{
  "hello": "I'm HHe OR Call me Herbert",
  "description": "Graduated from Simon Fraser University with a MSc in Applied Mathematics. As a highly efficient full-stack engineer, I excel at tackling intricate tasks with remarkable speed. My skills extend to rapid prototyping, pragmatic problem-solving, and a remarkable aptitude for rapid learning. My proficiency encompasses JavaScript, TypeScript, and Python, while my familiarity includes React, Vue, NodeJS, and Flask. I possess an insatiable curiosity for novel software technologies that drive solutions and achievements, perpetually keeping my approach innovative and rejuvenated.",
  "personalInformation": [
    {
      "label": "Full Name",
      "value": "Herbert HE"
    },
    {
      "label": "Age",
      "value": "32"
    },
    {
      "label": "Based in",
      "value": "Vancouver, BC"
    },
    {
      "label": "E-mail",
      "value": "hbl2012@gmail.com"
    }
  ],
  "language": [
    {
      "label": "Chinese (Mandarin)",
      "score": 10,
      "value": "native"
    },
    {
      "label": "English",
      "score": 8,
      "value": "fluent"
    }
  ],
  "professionalSkills": [
    {
      "label": "SPA Framework (React.js, Vue.js)",
      "score": 90
    },
    {
      "label": "Python (FastApi, Pandas, Celery, etc.)",
      "score": 90
    },
    {
      "label": "NodeJS (Express.js)",
      "score": 80
    },
    {
      "label": "MySQL/MongoDB/DynamoDB",
      "score": 60
    },
    {
      "label": "Docker",
      "score": 70
    }
  ],
  "additionalSkills": [
    "Next.js", "Jest", "D3.js", "Redis", "AWS (ECS, S3, Lambda, DynamoDB, SQS, etc)", "Latex", "RabbitMQ", "and more..."
  ],
  "styledList": [
    "Powerful Learning Ability",
    "Effective Time Management Skill",
    "Self Motivated",
    "Abundant Problem-solving Experience"
  ],
  "workExperience": [
    {
      "start": "May 2023",
      "end": "May 2024",
      "company": "Know Your Customer",
      "city": "Remote",
      "title": "Senior Frontend Developer",
      "highlight": "",
      "responsibility": [
        "Refactored an existing Angular project to React, achieving higher performance and improved user experience.",
        "Rewrote existing pages and components using React and related technologies (e.g., Redux, ).",
        "Collaborated with backend team to ensure smooth data interaction between frontend and backend.",
        "Developed end-to-end tests using Cypress for automated testing, ensuring application quality and stability."
      ],
      "techStack": ["React", "Redux", "TypeScript", "D3.js", "Cypress"]
    },
    {
      "start": "Mar 2021",
      "end": "May 2023",
      "company": "PG Forsta",
      "city": "Vancouver",
      "title": "Senior Frontend Developer",
      "highlight": "",
      "responsibility": [
        "Spearheaded the development and maintenance of the frontend project and NodeJS middlewares for a customer experience feedback product, ensuring seamless operation within the production environment.",
        "Oversaw the maintenance of an internally utilized React components package, guaranteeing its reliability and relevance.",
        "MainWrote React unit tests and end-to-end tests, bolstering the project's robustness and user experience."
      ],
      "techStack": ["React", "Redux", "TypeScript", "NodeJS", "Express", "Jest"]
    },
    {
      "start": "Feb 2020",
      "end": "Feb 2021",
      "company": "PwC Shanghai Acceleration Center",
      "city": "Shanghai",
      "title": "Senior Technology Lead",
      "highlight": "",
      "responsibility": [
        "Led TypeScript full-stack development utilizing React and Node.js, with additional involvement in the development of the CI/CD pipeline to ensure seamless deployment and integration.",
        "Demonstrated adeptness in React UI development, seamlessly integrating advanced technologies such as D3.js and Google APIs to enhance user interfaces and overall functionality."
      ],
      "techStack": ["React", "Redux", "TypeScript", "NodeJS", "MongoDB"]
    },
    {
      "start": "Feb 2018",
      "end": "Feb 2020",
      "company": "3D Medicines (Shanghai) Co., Ltd",
      "city": "Shanghai",
      "title": "Data Engineer",
      "highlight": "Star Employee of the Year 2018 (Challenge the Impossible Award)",
      "responsibility": [
        "Conceptualized and executed the design and development of a distributed bioinformatics analysis framework using Python, contributing to enhanced efficiency and scalability in analysis processes.",
        "Engineered an automated context generation system for genetic testing reports, streamlining the report generation process and ensuring accuracy.",
        "Constructed a web crawler to gather genetic variant information, furnishing a valuable data repository for further analysis and research.",
        "Orchestrated the end-to-end development of a clinical knowledge base, including the frontend, backend, and database components. This comprehensive contribution resulted in a robust and functional system for clinical information management."
      ],
      "techStack": ["Python", "Vue", "MySQL", "Docker", "Redis", "Neo4j"]
    }
  ],
  "otherProjects": [
    {
      "start": "2023",
      "end": "2024",
      "company": "Newcast",
      "link": "https://newcast.ai",
      "highlight": "A website that simplifies the creation of marketing videos. Leverage AI avatars to bring your scripts to life and effortlessly animate captions for greater impact.",
      "responsibility": [
        "Build the Next.js frontend and Python API for an AI avatar video creation website."
      ],
      "techStack": ["Next.js", "Python (FastApi, LangChain)", "AWS (ECS, S3, Lambda, DynamoDB, SQS, etc)"]
    },
    {
      "start": "2022",
      "end": "2023",
      "company": "Artsio.xyz",
      "link": "https://artsio.xyz",
      "highlight": "Discover, inspire, and create AI generated images using stable diffusion models.",
      "responsibility": [
        "Build the Next.js frontend and integrate the Python API for the AIGC website"
      ],
      "techStack": ["Next.js", "Python (Sanic)", "AWS (ECS, S3, Lambda, DynamoDB, SQS, etc)"]
    }
  ],
  "education": [
    {
      "start": "Sep 2015",
      "end": "Dec 2017",
      "company": "Simon Fraser University",
      "city": "Vancouver",
      "title": "Master in Applied Mathematics (Operation Research)",
      "highlight": "SFU Graduate Fellowship 2016",
      "responsibility": [
        "Master Project: Analysis of Firefighter Absences and Hiring Schedule Optimization at the Surrey FireDepartment",
        "Coursework: continuous/discrete optimization, network flows, linear programming, numerical methods incontinuous optimization, analytic number theory."
      ]
    },
    {
      "start": "Sep 2010",
      "end": "Apr 2015",
      "company": "York University",
      "city": "Toronto",
      "title": "Bachelor in Applied Mathematics",
      "highlight": "Dean’s Honour Roll 2013 & 2014",
      "responsibility": [
        "Coursework: combinatorics, cryptography, simulation and Monte Carlo methods, financial mathematics."
      ]
    }
  ]
}